//=============================================================================
//
// エネミーモデル処理 [enemyskeletons.h]
// Author : 銭子軒（チェンズーシェン）
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_SKELETONS		(5)					// スケルトンの数


//*****************************************************************************
// 構造体定義
//*****************************************************************************



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitEnemySkeletons(void);
void UninitEnemySkeletons(void);
void UpdateEnemySkeletons(void);
void DrawEnemySkeletons(void);

ENEMY *GetEnemySkeletons(void);
void SetEnemySkeletonsDamage(float damge);
void EnemySkeletonsMoving(XMFLOAT3 pos, float time);

